In [2]:
test = "test"
type(test)

str

In [3]:
x = "abcd"
type(x)

str

In [4]:
x = 100
type(x)

int

In [5]:
x = 3.14
type(x)

float

In [6]:
myList = [1,2,3,4,5]
myTuple = (1,2,3,4,5)
myDict = {"one": 1, "two": 2, "three": 3, "four": 4, "five": 5}
type(myList)
type(myDict)

dict

In [7]:
myDict["one"]

1

In [8]:
x = range(1,5)

In [9]:
x

range(1, 5)

In [10]:
x[1]

2

In [11]:
x = list(range(5))

In [12]:
x

[0, 1, 2, 3, 4]

In [13]:
myList = [ "apple", "orange", "banana", "orange", "banana", "apple"]
set(myList)

{'apple', 'banana', 'orange'}

In [14]:
from enum import Enum, auto

In [15]:
class Gender(Enum):
    male = auto()
    female = auto()
    others = auto()

In [16]:
[Gender.male, Gender.female, Gender.others]

In [17]:
x = Gender.male
type(x)

In [18]:
sample = [1,2,3,4,5,6]

In [19]:
squares = [x**2 for x in sample]

In [20]:
squares

[1, 4, 9, 16, 25, 36]

In [21]:
[x**2 for x in sample if x%2==0]

[4, 16, 36]

In [22]:
[x**2 if x%2==0 else x**3 for x in sample]

[1, 4, 27, 16, 125, 36]

In [23]:
{x:x**2 if x%2==0 else -x for x in sample}

{1: -1, 2: 4, 3: -3, 4: 16, 5: -5, 6: 36}

In [24]:
x = [1,2,1,2,3,2,1]
set(x)

{1, 2, 3}

In [25]:
import numpy as np

In [26]:
x = np.array([2,3,5,7,9])

In [27]:
x

array([2, 3, 5, 7, 9])

In [28]:
type(x)

numpy.ndarray

In [29]:
import pandas as pd

In [30]:
import matplotlib.pyplot as plt
%matplotlib inline

In [31]:
data = [
    ['p01', 162.3, 55.6,   23, 'Male'  , 'A' ],
    ['p02', 173.1, 62.0,   35, 'Male'  , 'AB'],
    ['p03', 158.8, 68.5,   47, 'Male'  , 'B' ],
    ['p04', 120.8, 24.3,    8, 'Female', None],  
    ['p05', 145.7, 37.8,   11, 'Female', None],
    ['p06', 159.2, 44.5,   13, 'Male'  , 'O' ],
    ['p07', 157.5, 49.0,   18, 'Female', 'B' ],
    ['p08', 158.9, None, None, ' '     , 'A' ],
    ['p09', 160.4, 48.5,   30, ''      , 'A' ],
    ['p10', 170.0, 77.7,   51, 'Male'  , 'O' ] ]

In [32]:
data

[['p01', 162.3, 55.6, 23, 'Male', 'A'],
 ['p02', 173.1, 62.0, 35, 'Male', 'AB'],
 ['p03', 158.8, 68.5, 47, 'Male', 'B'],
 ['p04', 120.8, 24.3, 8, 'Female', None],
 ['p05', 145.7, 37.8, 11, 'Female', None],
 ['p06', 159.2, 44.5, 13, 'Male', 'O'],
 ['p07', 157.5, 49.0, 18, 'Female', 'B'],
 ['p08', 158.9, None, None, ' ', 'A'],
 ['p09', 160.4, 48.5, 30, '', 'A'],
 ['p10', 170.0, 77.7, 51, 'Male', 'O']]

In [33]:
colmunNames = ['person','height','weight','age','gender','blood']

In [34]:
df = pd.DataFrame(data, columns=colmunNames)

In [35]:
df

  person  height  weight   age  gender blood
0    p01   162.3    55.6  23.0    Male     A
1    p02   173.1    62.0  35.0    Male    AB
2    p03   158.8    68.5  47.0    Male     B
3    p04   120.8    24.3   8.0  Female  None
4    p05   145.7    37.8  11.0  Female  None
5    p06   159.2    44.5  13.0    Male     O
6    p07   157.5    49.0  18.0  Female     B
7    p08   158.9     NaN   NaN             A
8    p09   160.4    48.5  30.0             A
9    p10   170.0    77.7  51.0    Male     O

In [36]:
import os
cwd = os.getcwd()
cwd

'/home/fujita/workspace/udemy_data'

In [37]:
df.to_csv("./sample_data.csv", index=False)

In [38]:
df1 = pd.read_csv("./sample_data.csv")

In [39]:
df1

  person  height  weight   age  gender blood
0    p01   162.3    55.6  23.0    Male     A
1    p02   173.1    62.0  35.0    Male    AB
2    p03   158.8    68.5  47.0    Male     B
3    p04   120.8    24.3   8.0  Female   NaN
4    p05   145.7    37.8  11.0  Female   NaN
5    p06   159.2    44.5  13.0    Male     O
6    p07   157.5    49.0  18.0  Female     B
7    p08   158.9     NaN   NaN             A
8    p09   160.4    48.5  30.0     NaN     A
9    p10   170.0    77.7  51.0    Male     O

In [40]:
df.shape

(10, 6)

In [41]:
type(df.shape)

tuple

In [42]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [43]:
df.columns

Index(['person', 'height', 'weight', 'age', 'gender', 'blood'], dtype='object')

In [44]:
df1.head

<bound method NDFrame.head of   person  height  weight   age  gender blood
0    p01   162.3    55.6  23.0    Male     A
1    p02   173.1    62.0  35.0    Male    AB
2    p03   158.8    68.5  47.0    Male     B
3    p04   120.8    24.3   8.0  Female   NaN
4    p05   145.7    37.8  11.0  Female   NaN
5    p06   159.2    44.5  13.0    Male     O
6    p07   157.5    49.0  18.0  Female     B
7    p08   158.9     NaN   NaN             A
8    p09   160.4    48.5  30.0     NaN     A
9    p10   170.0    77.7  51.0    Male     O>

In [45]:
df1.head(5)

  person  height  weight   age  gender blood
0    p01   162.3    55.6  23.0    Male     A
1    p02   173.1    62.0  35.0    Male    AB
2    p03   158.8    68.5  47.0    Male     B
3    p04   120.8    24.3   8.0  Female   NaN
4    p05   145.7    37.8  11.0  Female   NaN

In [46]:
df1

  person  height  weight   age  gender blood
0    p01   162.3    55.6  23.0    Male     A
1    p02   173.1    62.0  35.0    Male    AB
2    p03   158.8    68.5  47.0    Male     B
3    p04   120.8    24.3   8.0  Female   NaN
4    p05   145.7    37.8  11.0  Female   NaN
5    p06   159.2    44.5  13.0    Male     O
6    p07   157.5    49.0  18.0  Female     B
7    p08   158.9     NaN   NaN             A
8    p09   160.4    48.5  30.0     NaN     A
9    p10   170.0    77.7  51.0    Male     O

In [47]:
df = df1

In [48]:
df.set_index("person", inplace=True)
df

        height  weight   age  gender blood
person
p01      162.3    55.6  23.0    Male     A
p02      173.1    62.0  35.0    Male    AB
p03      158.8    68.5  47.0    Male     B
p04      120.8    24.3   8.0  Female   NaN
p05      145.7    37.8  11.0  Female   NaN
p06      159.2    44.5  13.0    Male     O
p07      157.5    49.0  18.0  Female     B
p08      158.9     NaN   NaN             A
p09      160.4    48.5  30.0     NaN     A
p10      170.0    77.7  51.0    Male     O

In [49]:
df.tail(3)

        height  weight   age gender blood
person
p08      158.9     NaN   NaN            A
p09      160.4    48.5  30.0    NaN     A
p10      170.0    77.7  51.0   Male     O

In [50]:
df.height.describe()

count     10.000000
mean     156.670000
std       14.593914
min      120.800000
25%      157.825000
50%      159.050000
75%      161.825000
max      173.100000
Name: height, dtype: float64

In [51]:
df.describe()

           height     weight        age
count   10.000000   9.000000   9.000000
mean   156.670000  51.988889  26.222222
std     14.593914  16.171460  15.626722
min    120.800000  24.300000   8.000000
25%    157.825000  44.500000  13.000000
50%    159.050000  49.000000  23.000000
75%    161.825000  62.000000  35.000000
max    173.100000  77.700000  51.000000

In [52]:
df.gender.describe()

count        9
unique       3
top       Male
freq         5
Name: gender, dtype: object

In [53]:
set(df.gender)

{' ', 'Female', 'Male', nan}

In [54]:
set([type(x) for x in df.gender])

{float, str}

In [55]:
df

        height  weight   age  gender blood
person
p01      162.3    55.6  23.0    Male     A
p02      173.1    62.0  35.0    Male    AB
p03      158.8    68.5  47.0    Male     B
p04      120.8    24.3   8.0  Female   NaN
p05      145.7    37.8  11.0  Female   NaN
p06      159.2    44.5  13.0    Male     O
p07      157.5    49.0  18.0  Female     B
p08      158.9     NaN   NaN             A
p09      160.4    48.5  30.0     NaN     A
p10      170.0    77.7  51.0    Male     O

In [56]:
df.weight["p02"]

62.0